INSERT INTO categories (category_name, parent_id) VALUES 
('Столярные изделия', NULL),
('Стройматериалы', NULL),
('Водоснабжение', NULL),
('Скобяные изделия', NULL),
('Электротовары', NULL),
('Инструменты', NULL),
('Краски', NULL);
INSERT INTO categories (category_name, parent_id) VALUES 
('Древесно-плитные материалы', 1),
('Пиломатериалы', 1),
('Отделка деревом', 1),
('Терасная доска', 1);
INSERT INTO categories (category_name, parent_id) VALUES 
('Сухие смеси и грунтовки', 2),
('Изоляционные материалы', 2),
('Листовые материалы', 2),
('Кровля', 2),
('Профиль для гипсокартона', 2),
('Блоки для строительства', 2),
('Металлопрокат', 2);
INSERT INTO categories (category_name, parent_id) VALUES 
('Штукатурки', 12),
('Шпаклёвки', 12),
('Смеси для полов', 12),
('Цемент', 12),
('Строительная химия', 12);
INSERT INTO categories (category_name, parent_id) VALUES 
('Рейки', 9),
('Бруски', 9),
('Доски', 9);
INSERT INTO products (article, category_id, product_name, description, price, stock) VALUES
(112378903, 25, 'Брусок строганый 40x40x3000 мм хвоя сорт', 'Особенности бруска
Сечение квадратное, размеры — 40×40 мм.
Длина бруска — 3 м.
Для изготовления использовался массив сосны российского происхождения.
Поверхность строганая, гладкая, имеются мелкие узлы.
Материал легко пилится и фрезеруется, пригоден для обработки пропитками, морилками, лакирования или окрашивания.', 320, 800),
(112378904, 25, 'Брусок строганый 30x30x3000 мм хвоя сорт', 'Особенности бруска
Сечение квадратное, размеры — 30×30 мм.
Длина бруска — 3 м.
Для изготовления использовался массив сосны российского происхождения.
Поверхность строганая, гладкая, имеются мелкие узлы.
Материал легко пилится и фрезеруется, пригоден для обработки пропитками, морилками, лакирования или окрашивания.', 270, 600),
(112378905, 25, 'Брусок строганый 25x25x3000 мм хвоя сорт', 'Особенности бруска
Сечение квадратное, размеры — 25×25 мм.
Длина бруска — 3 м.
Для изготовления использовался массив сосны российского происхождения.
Поверхность строганая, гладкая, имеются мелкие узлы.
Материал легко пилится и фрезеруется, пригоден для обработки пропитками, морилками, лакирования или окрашивания.', 230, 500),
(112378906, 25, 'Брусок строганый 20x20x3000 мм хвоя сорт', 'Особенности бруска
Сечение квадратное, размеры — 20×20 мм.
Длина бруска — 3 м.
Для изготовления использовался массив сосны российского происхождения.
Поверхность строганая, гладкая, имеются мелкие узлы.
Материал легко пилится и фрезеруется, пригоден для обработки пропитками, морилками, лакирования или окрашивания.', 190, 400),
(112378907, 25, 'Брусок строганый 60x60x3000 мм хвоя сорт', 'Особенности бруска
Сечение квадратное, размеры — 60×60 мм.
Длина бруска — 3 м.
Для изготовления использовался массив сосны российского происхождения.
Поверхность строганая, гладкая, имеются мелкие узлы.
Материал легко пилится и фрезеруется, пригоден для обработки пропитками, морилками, лакирования или окрашивания.', 420, 900),
(112378908, 25, 'Брусок строганый 70x70x3000 мм хвоя сорт', 'Особенности бруска
Сечение квадратное, размеры — 70×70 мм.
Длина бруска — 3 м.
Для изготовления использовался массив сосны российского происхождения.
Поверхность строганая, гладкая, имеются мелкие узлы.
Материал легко пилится и фрезеруется, пригоден для обработки пропитками, морилками, лакирования или окрашивания.', 480, 850),
(112378909, 25, 'Брусок строганый 80x80x3000 мм хвоя сорт', 'Особенности бруска
Сечение квадратное, размеры — 80×80 мм.
Длина бруска — 3 м.
Для изготовления использовался массив сосны российского происхождения.
Поверхность строганая, гладкая, имеются мелкие узлы.
Материал легко пилится и фрезеруется, пригоден для обработки пропитками, морилками, лакирования или окрашивания.', 540, 700),
(112378910, 25, 'Брусок строганый 90x90x3000 мм хвоя сорт', 'Особенности бруска
Сечение квадратное, размеры — 90×90 мм.
Длина бруска — 3 м.
Для изготовления использовался массив сосны российского происхождения.
Поверхность строганая, гладкая, имеются мелкие узлы.
Материал легко пилится и фрезеруется, пригоден для обработки пропитками, морилками, лакирования или окрашивания.', 600, 600),
(112378911, 25, 'Брусок строганый 100x100x3000 мм хвоя сорт', 'Особенности бруска
Сечение квадратное, размеры — 100×100 мм.
Длина бруска — 3 м.
Для изготовления использовался массив сосны российского происхождения.
Поверхность строганая, гладкая, имеются мелкие узлы.
Материал легко пилится и фрезеруется, пригоден для обработки пропитками, морилками, лакирования или окрашивания.', 650, 500),
(112378912, 25, 'Брусок строганый 110x110x3000 мм хвоя сорт', 'Особенности бруска
Сечение квадратное, размеры — 110×110 мм.
Длина бруска — 3 м.
Для изготовления использовался массив сосны российского происхождения.
Поверхность строганая, гладкая, имеются мелкие узлы.
Материал легко пилится и фрезеруется, пригоден для обработки пропитками, морилками, лакирования или окрашивания.', 700, 450);

INSERT INTO products (article, category_id, product_name, description, price, stock) VALUES
(212378903, 24, 'Рейка строганая 15x25x2000 мм хвоя сорт Оптима', 'Рейка прямоугольная 2 м с мелкими узлами — расходный пиломатериал для строительных работ, отделки конструкций снаружи и внутри помещения, изготовления корпусной мебели и предметов интерьера. Рейка выполнена из прочного массива сосны. В состав хвойной древесины входят фитонциды, препятствующие размножению бактерий, грибка и насекомых. Смола упрочняет материал и предотвращает гниение.

Длина доски — 2 м.
Сечение — прямоугольник размером 15х25 мм.', 50, 900),
(212378904, 24, 'Рейка строганая 25x35x2000 мм хвоя сорт Оптима', 'Рейка прямоугольная 2 м с мелкими узлами — расходный пиломатериал для строительных работ, отделки конструкций снаружи и внутри помещения, изготовления корпусной мебели и предметов интерьера. Рейка выполнена из прочного массива сосны. В состав хвойной древесины входят фитонциды, препятствующие размножению бактерий, грибка и насекомых. Смола упрочняет материал и предотвращает гниение.

Длина доски — 2 м.
Сечение — прямоугольник размером 25х35 мм.', 75, 850),
(212378905, 24, 'Рейка строганая 30x40x2000 мм хвоя сорт Оптима', 'Рейка прямоугольная 2 м с мелкими узлами — расходный пиломатериал для строительных работ, отделки конструкций снаружи и внутри помещения, изготовления корпусной мебели и предметов интерьера. Рейка выполнена из прочного массива сосны. В состав хвойной древесины входят фитонциды, препятствующие размножению бактерий, грибка и насекомых. Смола упрочняет материал и предотвращает гниение.

Длина доски — 2 м.
Сечение — прямоугольник размером 30х40 мм.', 90, 800),
(212378906, 24, 'Рейка строганая 10x20x2000 мм хвоя сорт Оптима', 'Рейка прямоугольная 2 м с мелкими узлами — расходный пиломатериал для строительных работ, отделки конструкций снаружи и внутри помещения, изготовления корпусной мебели и предметов интерьера. Рейка выполнена из прочного массива сосны. В состав хвойной древесины входят фитонциды, препятствующие размножению бактерий, грибка и насекомых. Смола упрочняет материал и предотвращает гниение.

Длина доски — 2 м.
Сечение — прямоугольник размером 10х20 мм.', 40, 950),
(212378907, 24, 'Рейка строганая 35x45x2000 мм хвоя сорт Оптима', 'Рейка прямоугольная 2 м с мелкими узлами — расходный пиломатериал для строительных работ, отделки конструкций снаружи и внутри помещения, изготовления корпусной мебели и предметов интерьера. Рейка выполнена из прочного массива сосны. В состав хвойной древесины входят фитонциды, препятствующие размножению бактерий, грибка и насекомых. Смола упрочняет материал и предотвращает гниение.

Длина доски — 2 м.
Сечение — прямоугольник размером 35х45 мм.', 110, 700),
(212378908, 24, 'Рейка строганая 40x50x2000 мм хвоя сорт Оптима', 'Рейка прямоугольная 2 м с мелкими узлами — расходный пиломатериал для строительных работ, отделки конструкций снаружи и внутри помещения, изготовления корпусной мебели и предметов интерьера. Рейка выполнена из прочного массива сосны. В состав хвойной древесины входят фитонциды, препятствующие размножению бактерий, грибка и насекомых. Смола упрочняет материал и предотвращает гниение.

Длина доски — 2 м.
Сечение — прямоугольник размером 40х50 мм.', 125, 650),
(212378909, 24, 'Рейка строганая 20x40x2000 мм хвоя сорт Оптима', 'Рейка прямоугольная 2 м с мелкими узлами — расходный пиломатериал для строительных работ, отделки конструкций снаружи и внутри помещения, изготовления корпусной мебели и предметов интерьера. Рейка выполнена из прочного массива сосны. В состав хвойной древесины входят фитонциды, препятствующие размножению бактерий, грибка и насекомых. Смола упрочняет материал и предотвращает гниение.

Длина доски — 2 м.
Сечение — прямоугольник размером 20х40 мм.', 80, 750),
(212378910, 24, 'Рейка строганая 25x50x2000 мм хвоя сорт Оптима', 'Рейка прямоугольная 2 м с мелкими узлами — расходный пиломатериал для строительных работ, отделки конструкций снаружи и внутри помещения, изготовления корпусной мебели и предметов интерьера. Рейка выполнена из прочного массива сосны. В состав хвойной древесины входят фитонциды, препятствующие размножению бактерий, грибка и насекомых. Смола упрочняет материал и предотвращает гниение.

Длина доски — 2 м.
Сечение — прямоугольник размером 25х50 мм.', 100, 800),
(212378911, 24, 'Рейка строганая 30x60x2000 мм хвоя сорт Оптима', 'Рейка прямоугольная 2 м с мелкими узлами — расходный пиломатериал для строительных работ, отделки конструкций снаружи и внутри помещения, изготовления корпусной мебели и предметов интерьера. Рейка выполнена из прочного массива сосны. В состав хвойной древесины входят фитонциды, препятствующие размножению бактерий, грибка и насекомых. Смола упрочняет материал и предотвращает гниение.

Длина доски — 2 м.
Сечение — прямоугольник размером 30х60 мм.', 130, 850),
(212378912, 24, 'Рейка строганая 35x50x2000 мм хвоя сорт Оптима', 'Рейка прямоугольная 2 м с мелкими узлами — расходный пиломатериал для строительных работ, отделки конструкций снаружи и внутри помещения, изготовления корпусной мебели и предметов интерьера. Рейка выполнена из прочного массива сосны. В состав хвойной древесины входят фитонциды, препятствующие размножению бактерий, грибка и насекомых. Смола упрочняет материал и предотвращает гниение.

Длина доски — 2 м.
Сечение — прямоугольник размером 35х50 мм.', 120, 950),
(212378913, 24, 'Рейка строганая 40x60x2000 мм хвоя сорт Оптима', 'Рейка прямоугольная 2 м с мелкими узлами — расходный пиломатериал для строительных работ, отделки конструкций снаружи и внутри помещения, изготовления корпусной мебели и предметов интерьера. Рейка выполнена из прочного массива сосны. В состав хвойной древесины входят фитонциды, препятствующие размножению бактерий, грибка и насекомых. Смола упрочняет материал и предотвращает гниение.

Длина доски — 2 м.
Сечение — прямоугольник размером 40х60 мм.', 140, 700);


INSERT INTO attributes (attribute_name) VALUES 
('Материал'),
('Размер'),
('Сорт')
-- Вставка атрибутов продуктов
INSERT INTO product_attributes (product_id, attribute_name_id, attribute_value) VALUES 

(1, '1', 'Сосна'),
(1, '2', '40x40x3000 мм'),
(1, '3', 'Хвоя'),

(2, '1', 'Сосна'),
(2, '2', '30x30x3000 мм'),
(2, '3', 'Хвоя'),

(3, '1', 'Сосна'),
(3, '2', '25x25x3000 мм'),
(3, '3', 'Хвоя'),

(4, '1', 'Сосна'),
(4, '2', '20x20x3000 мм'),
(4, '3', 'Хвоя'),

(5, '1', 'Сосна'),
(5, '2', '60x60x3000 мм'),
(5, '3', 'Хвоя'),

(6, '1', 'Сосна'),
(6, '2', '70x70x3000 мм'),
(6, '3', 'Хвоя'),

(7, '1', 'Сосна'),
(7, '2', '80x80x3000 мм'),
(7, '3', 'Хвоя'),

(8, '1', 'Сосна'),
(8, '2', '90x90x3000 мм'),
(8, '3', 'Хвоя'),

(9, '1', 'Сосна'),
(9, '2', '100x100x3000 мм'),
(9, '3', 'Хвоя'),

(10, '1', 'Сосна'),
(10, '2', '110x110x3000 мм'),
(10, '3', 'Хвоя'),

(11, '1', 'Сосна'),
(11, '2', '15x25x2000 мм'),
(11, '3', 'Оптима'),

(12, '1', 'Сосна'),
(12, '2', '25x35x2000 мм'),
(12, '3', 'Оптима'),

(13, '1', 'Сосна'),
(13, '2', '30x40x2000 мм'),
(13, '3', 'Оптима'),

(14, '1', 'Сосна'),
(14, '2', '10x20x2000 мм'),
(14, '3', 'Оптима'),

(15, '1', 'Сосна'),
(15, '2', '35x45x2000 мм'),
(15, '3', 'Оптима'),

(16, '1', 'Сосна'),
(16, '2', '40x50x2000 мм'),
(16, '3', 'Оптима'),

(17, '1', 'Сосна'),
(17, '2', '20x40x2000 мм'),
(17, '3', 'Оптима'),

(18, '1', 'Сосна'),
(18, '2', '25x50x2000 мм'),
(18, '3', 'Оптима'),

(19, '1', 'Сосна'),
(19, '2', '30x60x2000 мм'),
(19, '3', 'Оптима'),

(20, '1', 'Сосна'),
(20, '2', '35x50x2000 мм'),
(20, '3', 'Оптима'),

(21, '1', 'Сосна'),
(21, '2', '40x60x2000 мм'),
(21, '3', 'Оптима');